**Lab | Customer Analysis Round 1**

Remember the process:

1. Case Study
2. Get data
3. Cleaning/Wrangling/EDA
4. Processing Data
5. Modeling
6. Validation
7. Reporting

Abstract

The objective of this data is to understand customer demographics and buying behavior. Later during the week, we will use predictive analytics to analyze the most profitable customers and how they interact. After that, we will take targeted actions to increase profitable customer response, retention, and growth.

For this lab, we will gather the data from 3 csv files that are provided in the files_for_lab folder. Use that data and complete the data cleaning tasks as mentioned later in the instructions.

**Tasks**

Task 1 Read the three files into python as dataframes

In [ ]:
#Importing necessary libraries
import pandas as pd
import numpy as np

In [ ]:
#Assigning and reading the first file (file1.csv)
url1 = 'https://raw.githubusercontent.com/ironhack-labs/lab-customer-analysis-round-1/master/files_for_lab/csv_files/file1.csv'
data_file1 = pd.read_csv(url1)
data_file1.head()

  Customer          ST  ...  Vehicle Class Total Claim Amount
0  RB50392  Washington  ...  Four-Door Car           2.704934
1  QZ44356     Arizona  ...  Four-Door Car        1131.464935
2  AI49188      Nevada  ...   Two-Door Car         566.472247
3  WW63253  California  ...            SUV         529.881344
4  GA49547  Washington  ...  Four-Door Car          17.269323

[5 rows x 11 columns]

In [ ]:
#Assigning and reading the second file (file2.csv)
url2 = 'https://raw.githubusercontent.com/ironhack-labs/lab-customer-analysis-round-1/master/files_for_lab/csv_files/file2.csv'
data_file2 = pd.read_csv(url2)
data_file2.head()

  Customer          ST  ...     Policy Type  Vehicle Class
0  GS98873     Arizona  ...   Personal Auto  Four-Door Car
1  CW49887  California  ...    Special Auto            SUV
2  MY31220  California  ...   Personal Auto   Two-Door Car
3  UH35128      Oregon  ...   Personal Auto     Luxury Car
4  WH52799     Arizona  ...  Corporate Auto   Two-Door Car

[5 rows x 11 columns]

In [ ]:
data_file1.describe()

             Income  Monthly Premium Auto  Total Claim Amount
count   1071.000000           1071.000000         1071.000000
mean   39295.701214            193.234360          404.986909
std    30469.427060           1601.190369          293.027260
min        0.000000             61.000000            0.382107
25%    14072.000000             68.000000          202.157702
50%    36234.000000             83.000000          354.729129
75%    64631.000000            109.500000          532.800000
max    99960.000000          35354.000000         2893.239678

In [ ]:
#Assigning and reading the third file (file3.csv)
url3 = 'https://raw.githubusercontent.com/ironhack-labs/lab-customer-analysis-round-1/master/files_for_lab/csv_files/file3.csv'
data_file3 = pd.read_csv(url3)
data_file3.head()

  Customer       State  ...  Total Claim Amount  Vehicle Class
0  SA25987  Washington  ...          499.200000   Two-Door Car
1  TB86706     Arizona  ...            3.468912   Two-Door Car
2  ZL73902      Nevada  ...          393.600000  Four-Door Car
3  KX23516  California  ...          699.615192            SUV
4  FN77294  California  ...          484.800000            SUV

[5 rows x 11 columns]

**Task 2** Show the DataFrame's shape.

In [ ]:
#data_file1 shape
data_file1.shape

(4008, 11)

In [ ]:
#data_file2 shape
data_file2.shape

(996, 11)

In [ ]:
#data_file2 shape
data_file3.shape

(7070, 11)

Finding: We see, number of columns are the same so we are good to proceed in terms of the number of columns, but the columns are not in order so we may need to rearrange them later.

**Task 3** Standardize header names.

Let's look at column headers first and see what is the easiest way to standardize them across three file dataframes.

In [ ]:
#assigning variables to column names for each dataframes.
column_names1 = data_file1.columns
column_names2 = data_file2.columns
column_names3 = data_file3.columns

In [ ]:
#standardizing data_file1
cols_1 = []
#[column_names1.lower() for column_names1 in data_file1.columns]

for column_names1 in data_file1.columns:
  cols_1.append(column_names1.lower())

data_file1.columns= cols_1

In [ ]:
#standardizing data_file2
cols_2 = []
#[column_names2.lower() for column_names2 in data_file2.columns]

for column_names2 in data_file2.columns:
  cols_2.append(column_names2.lower())

data_file2.columns= cols_2

In [ ]:
#standardizing data_file3
cols_3 = []
#[column_names2.lower() for column_names2 in data_file2.columns]

for column_names3 in data_file3.columns:
  cols_3.append(column_names3.lower())

data_file3.columns= cols_3

In [ ]:
#customer lifetime value - first two files have % in the end, but the third file doesnot have it. We need to correct those.
data_file1['customer lifetime value'].dtype

dtype('O')

In [ ]:
#noticed % sign on customer lifetime value in first two datafiles, so they need to be removed
#defining a function to remove %
def remove_perc_sign(x):
  if type(x)==str:
    return x.replace("%"," ")
    #if x.endswith('%'):
      #return x[:-1]
    #else:
      #return float(x)
  else:
    return float(x)

In [ ]:
data_file1['customer lifetime value'] = list(map(remove_perc_sign,data_file1['customer lifetime value']))
data_file1['customer lifetime value'].head()

0            NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer lifetime value, dtype: object

In [ ]:
data_file2['customer lifetime value'] = list(map(remove_perc_sign,data_file2['customer lifetime value']))
data_file2['customer lifetime value'].head()

0     323912.47
1     462680.11
2     899704.02
3    2580706.30
4     380812.21
Name: customer lifetime value, dtype: object

In [ ]:
#after removing the % we need to convert customer lifetime values to float, defining a function for that
def conv_float(x):
  if type(x) == str:
    return float(x)
  else:
    return x

In [ ]:
data_file2['customer lifetime value'] = list(map(conv_float,data_file2['customer lifetime value']))
data_file2['customer lifetime value'].head()

0     323912.47
1     462680.11
2     899704.02
3    2580706.30
4     380812.21
Name: customer lifetime value, dtype: float64

In [ ]:
data_file1['customer lifetime value'] = list(map(conv_float,data_file1['customer lifetime value']))
data_file1['customer lifetime value'].head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: customer lifetime value, dtype: float64

**Task 4** Rearrange the columns in the dataframe as needed

In [ ]:
#list of column headers data_file1

data_file1.columns.tolist()

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [ ]:
#list of column headers data_file2

data_file2.columns.tolist()

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'total claim amount',
 'policy type',
 'vehicle class']

In [ ]:
#in data_file2 has column header 'Total Claim Amount' in the wrong column index. It will be easier to move it to the last position.
data_file2 = data_file2.reindex(columns=['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount'])
data_file2.columns.tolist()

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [ ]:
#.list of column headers data_file3
data_file3.columns.tolist()

['customer',
 'state',
 'customer lifetime value',
 'education',
 'gender',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'total claim amount',
 'vehicle class']

In [ ]:
#in data_file3 reindexing the headers to the same column headers as in data_file1
data_file3 = data_file3.reindex(columns=['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount'])
data_file3.columns.tolist()

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

Task 5 Concatenate the three dataframes

In [ ]:
data = pd.concat([data_file1,data_file2,data_file3],axis =0)

In [ ]:
data.shape

(12074, 11)

In [ ]:
data.head()

  customer          st  ...  vehicle class total claim amount
0  RB50392  Washington  ...  Four-Door Car           2.704934
1  QZ44356     Arizona  ...  Four-Door Car        1131.464935
2  AI49188      Nevada  ...   Two-Door Car         566.472247
3  WW63253  California  ...            SUV         529.881344
4  GA49547  Washington  ...  Four-Door Car          17.269323

[5 rows x 11 columns]

In [ ]:
data.sample()

     customer   st gender  ...     policy type  vehicle class  total claim amount
3571  LC69427  NaN      F  ...  Corporate Auto  Four-Door Car               345.6

[1 rows x 11 columns]

Findings:
1. Noticed customer column is actually storing car plates. I will keep it as it is for now, as it may not matter in this analysis to change it. 
2. gender has null values
3. CLV needs to be corrected.

**Task 6/7** : Which columns are numerical? Which columns are categorical?

**by looking at the data**

1. customer                      - categorical
2. st                            - categorical
3. gender                        - categorical
4. education                     - categorical
5. customer lifetime value       - numerical
6. income                        - numerical
7. monthly premium auto          - numerical
8. number of open complaints     - numerical/categorical
9. policy type                   - categorical
10. vehicle class                - categorical
11. total claim amount           - numerical

In [ ]:
#check if data types match the above deductions
data.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [ ]:
#check if numeric data types match the above deductions
data._get_numeric_data()

      customer lifetime value  ...  total claim amount
0                         NaN  ...            2.704934
1                6.979536e+05  ...         1131.464935
2                1.288743e+06  ...          566.472247
3                7.645862e+05  ...          529.881344
4                5.363077e+05  ...           17.269323
...                       ...  ...                 ...
7065             2.340599e+04  ...          198.234764
7066             3.096511e+03  ...          379.200000
7067             8.163890e+03  ...          790.784983
7068             7.524442e+03  ...          691.200000
7069             2.611837e+03  ...          369.600000

[12074 rows x 4 columns]

In [ ]:
#check if object data types match the above deductions
data.select_dtypes('object')

     customer          st  ...     policy type  vehicle class
0     RB50392  Washington  ...   Personal Auto  Four-Door Car
1     QZ44356     Arizona  ...   Personal Auto  Four-Door Car
2     AI49188      Nevada  ...   Personal Auto   Two-Door Car
3     WW63253  California  ...  Corporate Auto            SUV
4     GA49547  Washington  ...   Personal Auto  Four-Door Car
...       ...         ...  ...             ...            ...
7065  LA72316         NaN  ...   Personal Auto  Four-Door Car
7066  PK87824         NaN  ...  Corporate Auto  Four-Door Car
7067  TD14365         NaN  ...  Corporate Auto  Four-Door Car
7068  UP19263         NaN  ...   Personal Auto  Four-Door Car
7069  Y167826         NaN  ...  Corporate Auto   Two-Door Car

[12074 rows x 7 columns]

**Task 8**: Understand the meaning of all columns

**by looking at data above- deductions**
1. customer - this column identifies individual customer (through car plate numbers in this dataset). Datatype: String
2. st - this column idetifies where the customer has the policy registered. Data type: string                        
3. gender - this column identifies the gender of the customer. datatype: string 
4. education- this column probably stores the highest level of education of the customer. 
5. customer lifetime value - this column is the total amount of money customer is expected to spend in this company. 
6. income - this column stores the real/reported/predicted income level of the customer.                      
7. monthly premium auto - this is the amount of monthly premiums on their policy.          - 
8. number of open complaints - this column stores the number of open complaints stored from the customer. It is stored in #1/#2/# format so probably it is storing it in categorical way like departments or identifiers.
9. policy type - this column stores the type of policy chosen by the customer, so it can be the policy options offered by this company.
10. vehicle class - this column is storing the type of vehicle (probably the policy types are dependant on this)
11. total claim amount- this column is storing the total amount claimed by the customer. this needs to be checked and probably paid out/rejected dependant on the claim.

**Task 9**: Perform the data cleaning operations mentioned so far in class

In [ ]:
#drop the columns education and number of open complaints.
data = data.drop(['education'],axis=1)
data = data.drop(['number of open complaints'],axis = 1)
data.head(5)

#ran data = above commands, which removed 'education' and 'number of opens' and now it cannot find it, so it gives the KeyError

  customer          st  ...  vehicle class  total claim amount
0  RB50392  Washington  ...  Four-Door Car            2.704934
1  QZ44356     Arizona  ...  Four-Door Car         1131.464935
2  AI49188      Nevada  ...   Two-Door Car          566.472247
3  WW63253  California  ...            SUV          529.881344
4  GA49547  Washington  ...  Four-Door Car           17.269323

[5 rows x 9 columns]

In [ ]:
#remove_perc_sign = lambda x: if x.str.replace("%","")
#tried doing it here first later, but moved the code to the top.
#def remove_perc_sign(x):
 # if type(x)==str:
 #   return x.replace("%"," ")
    #if x.endswith('%'):
      #return x[:-1]
    #else:
      #return float(x)
 # else:
#    return float(x)

#data['customer lifetime value'] = list(map(remove_perc_sign,data['customer lifetime value']))
#data['customer lifetime value'].head()
#data

In [ ]:
#same as last code box
#convert to float

#def conv_float(x):
 # if type(x) == str:
#    return float(x)
 # else:
 #   return x
#data['customer lifetime value'] = list(map(conv_float,data['customer lifetime value']))
#data['customer lifetime value'].head()

In [ ]:
#Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

mult_100 = lambda x: x*100

data['customer lifetime value'] = list(map(mult_100, data['customer lifetime value']))

#data['customer lifetime value'].head(10)
data.head(10)

  customer          st  ...  vehicle class  total claim amount
0  RB50392  Washington  ...  Four-Door Car            2.704934
1  QZ44356     Arizona  ...  Four-Door Car         1131.464935
2  AI49188      Nevada  ...   Two-Door Car          566.472247
3  WW63253  California  ...            SUV          529.881344
4  GA49547  Washington  ...  Four-Door Car           17.269323
5  OC83172      Oregon  ...   Two-Door Car          159.383042
6  XZ87318      Oregon  ...  Four-Door Car          321.600000
7  CF85061     Arizona  ...  Four-Door Car          363.029680
8  DY87989      Oregon  ...  Four-Door Car          511.200000
9  BQ94931      Oregon  ...  Four-Door Car          425.527834

[10 rows x 9 columns]

In [ ]:
#already converted dtypes to float above for datafile1 and datafile2
#checking it again
data['customer lifetime value'].dtypes

dtype('float64')

In [ ]:
#check for duplicate rows in the data and remove if any:

#make a duplicate copy of the dataframe
data_c = data.copy()
data_c.shape

(12074, 9)

In [ ]:
#removing duplicate rows

data_c = data_c.drop_duplicates(subset=['customer','gender'],keep='last')
data_c.head(10)

   customer          st  ...  vehicle class  total claim amount
0   RB50392  Washington  ...  Four-Door Car            2.704934
1   QZ44356     Arizona  ...  Four-Door Car         1131.464935
2   AI49188      Nevada  ...   Two-Door Car          566.472247
3   WW63253  California  ...            SUV          529.881344
5   OC83172      Oregon  ...   Two-Door Car          159.383042
6   XZ87318      Oregon  ...  Four-Door Car          321.600000
7   CF85061     Arizona  ...  Four-Door Car          363.029680
8   DY87989      Oregon  ...  Four-Door Car          511.200000
9   BQ94931      Oregon  ...  Four-Door Car          425.527834
10  SX51350  California  ...  Four-Door Car          482.400000

[10 rows x 9 columns]

In [ ]:
#filtering the data for customers who have an income of 0 or less
data_c['income_zero'] = data_c['income']=0


#data_c['income_0_less'] = [(data_c['income']<0)|(data_c['income_zero'])]
data_c.head()

  customer          st gender  ...  vehicle class  total claim amount  income_zero
0  RB50392  Washington    NaN  ...  Four-Door Car            2.704934            0
1  QZ44356     Arizona      F  ...  Four-Door Car         1131.464935            0
2  AI49188      Nevada      F  ...   Two-Door Car          566.472247            0
3  WW63253  California      M  ...            SUV          529.881344            0
5  OC83172      Oregon      F  ...   Two-Door Car          159.383042            0

[5 rows x 10 columns]

In [ ]:
data_c['income_less_zero'] = data_c[data_c['income']<0]
data_c.sample(15)

     customer      st gender  ...  total claim amount  income_zero  income_less_zero
6875  GQ42004     NaN      M  ...          355.200000            0               NaN
7058  FH43628     NaN      F  ...          465.600000            0               NaN
1223  EH13261     NaN      M  ...          351.403677            0               NaN
4067  CV63337     NaN      F  ...          422.400000            0               NaN
3454  BM71358     NaN      M  ...          147.954285            0               NaN
3973  UM17151     NaN      M  ...          413.606733            0               NaN
4925  TN71469     NaN      F  ...          700.004018            0               NaN
3266  GS26763     NaN      F  ...          492.935479            0               NaN
406   TR67616  Oregon      M  ...           19.938981            0               NaN
623   NL41409  Oregon      F  ...          456.473115            0               NaN
3859  AZ38648     NaN      F  ...          257.248789            0               NaN
219   KJ50265     NaN      M  ...          436.800000            0               NaN
872   JO64487     NaN      F  ...          547.200000            0               NaN
1274  QL10321     NaN      F  ...          109.296118            0               NaN
3996  MO65595     NaN      F  ...          571.593637            0               NaN

[15 rows x 11 columns]

In [ ]:
data_c['income_0_less'] = [(data_c['income_zero'])|(data_c['income_less_zero'])]
data_c.head()

ValueError: ignored